In [1]:
import pandas as pd

In [2]:
ser = pd.Series([1,8,52,3.14])
ser

0     1.00
1     8.00
2    52.00
3     3.14
dtype: float64

In [3]:
ser.values
ser.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
obj = pd.Series([5,3,9,2.52], index=(['a','b','c','d']))
obj

a    5.00
b    3.00
c    9.00
d    2.52
dtype: float64

In [5]:
obj.index
obj.values #almost like a dict object

array([5.  , 3.  , 9.  , 2.52])

In [6]:
obj[['c','d']] #provide a list of index

c    9.00
d    2.52
dtype: float64

In [7]:
obj * 2
import numpy as np
np.exp(obj)

a     148.413159
b      20.085537
c    8103.083928
d      12.428597
dtype: float64

In [8]:
'c' in obj

True

In [9]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj2 = pd.Series(sdata) #creating a Series from dictionary

In [10]:
obj2

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [11]:
states = ['California', 'Ohio', 'Oregon', 'Texas'] #Providing a list to use as index
obj4 = pd.Series(sdata, index=states) #only creates the Series for indexes present in the list
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [12]:
pd.isnull(obj4) 
pd.notnull(obj4) #both methods return Boolean

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [13]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [14]:
obj2 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [15]:
obj4.name = 'Population'
obj4.index.name = 'State'

In [16]:
print(obj4)

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

In [17]:
obj
obj.index = ['Manu', 'Pavan', 'Uchkya', 'Changya']

In [18]:
obj

Manu       5.00
Pavan      3.00
Uchkya     9.00
Changya    2.52
dtype: float64

In [19]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [20]:
pd.DataFrame(data, columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [21]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [22]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [23]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [24]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [25]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [26]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [27]:
frame2['debt'] = 100
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   100
two    2001    Ohio  1.7   100
three  2002    Ohio  3.6   100
four   2001  Nevada  2.4   100
five   2002  Nevada  2.9   100
six    2003  Nevada  3.2   100

In [28]:
frame2['debt'] = np.arange(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [29]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2 #assigns the values from Series to DataFrame by matching indexes and inserts NaN for missing values

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [30]:
frame2['eastern'] = frame2['state'] == 'Ohio' #assigning value to non existing column creates a new column
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [31]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [32]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [33]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [34]:
pd.DataFrame(pop,index = ['carrot', 'cabbage', 2001]) #creates DataFrame for provided index list

         Nevada  Ohio
carrot      NaN   NaN
cabbage     NaN   NaN
2001        2.4   1.7

In [35]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [36]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [37]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [38]:
obj3 = pd.Series(['blue','red','yellow'], index = [0,1,2])
obj3

0      blue
1       red
2    yellow
dtype: object

In [39]:
obj4 = obj3.reindex(range(6), method = 'ffill')
obj4

0      blue
1       red
2    yellow
3    yellow
4    yellow
5    yellow
dtype: object

In [40]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3), index = ['a','c','d'], columns = ['ohio','texas','california'])
df1

   ohio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8

In [41]:
df2 = df1.reindex(['a','b','c','d'],)
df2

   ohio  texas  california
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [42]:
state = ['california', 'texas', 'Arizona']
df2.reindex(columns = state)

   california  texas  Arizona
a         2.0    1.0      NaN
b         NaN    NaN      NaN
c         5.0    4.0      NaN
d         8.0    7.0      NaN

In [43]:
df2.drop('california', axis = 1)

   ohio  texas
a   0.0    1.0
b   NaN    NaN
c   3.0    4.0
d   6.0    7.0

In [44]:
df2.drop('b', inplace = True) #Drops the row in place and doesn't return any value

In [45]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [46]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [47]:
data.loc[['Colorado'],['one','three']]

          one  three
Colorado    4      6

In [48]:
data.iloc[[1],[0,2]]

          one  three
Colorado    4      6

In [49]:
data.loc[:'Utah',['two','four']]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11

In [50]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [51]:
data.at['Utah','two']

9

In [52]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [53]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [54]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [55]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])

In [56]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [57]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [58]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [59]:
df2[1,'b'] = np.nan
df2

      a     b     c     d     e  (1, b)
0   0.0   1.0   2.0   3.0   4.0     NaN
1   5.0   6.0   7.0   8.0   9.0     NaN
2  10.0  11.0  12.0  13.0  14.0     NaN
3  15.0  16.0  17.0  18.0  19.0     NaN

In [60]:
df2.drop((1,'b'), axis = 1,inplace = True)
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [61]:
df2.loc[1,'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [62]:
df1.add(df2, fill_value=0) #fill the value wherever missing and then add

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [63]:
df1.reindex(columns = df2.columns, fill_value= 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [64]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]

In [65]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [66]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [67]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [68]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [69]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [70]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -1.355849  0.047368  1.691447
Ohio    0.943951  0.084762  0.823433
Texas  -0.068041  1.225634  2.073809
Oregon -0.224042  0.962558  1.018804

In [71]:
frame.apply(lambda x : max(x)- min(x), axis = 'columns')

Utah      3.047297
Ohio      0.859189
Texas     2.141849
Oregon    1.242846
dtype: float64

In [72]:
def f(x):
    return pd.Series([min(x), max(x)], index = ['min','max'])

In [73]:
frame.apply(f, axis = 'columns')

             min       max
Utah   -1.355849  1.691447
Ohio    0.084762  0.943951
Texas  -0.068041  2.073809
Oregon -0.224042  1.018804

In [74]:
myl = [1,2,45,6,5,3,3,2]
list(map((lambda x : '%.2f'%x), (myl)))

['1.00', '2.00', '45.00', '6.00', '5.00', '3.00', '3.00', '2.00']

In [75]:
form = lambda x : ['%.2f'%i for i in x]
form(myl)

['1.00', '2.00', '45.00', '6.00', '5.00', '3.00', '3.00', '2.00']

In [76]:
format = lambda x: '%.2f' % x

In [77]:
frame.applymap(format) #applymap function for DataFrame to apply function element wise

            b     d     e
Utah    -1.36  0.05  1.69
Ohio     0.94  0.08  0.82
Texas   -0.07  1.23  2.07
Oregon  -0.22  0.96  1.02

In [78]:
frame['e'].map(format) #map function for Series

Utah      1.69
Ohio      0.82
Texas     2.07
Oregon    1.02
Name: e, dtype: object

In [79]:
frame

               b         d         e
Utah   -1.355849  0.047368  1.691447
Ohio    0.943951  0.084762  0.823433
Texas  -0.068041  1.225634  2.073809
Oregon -0.224042  0.962558  1.018804

In [80]:
frame.sort_index() #not in-place

               b         d         e
Ohio    0.943951  0.084762  0.823433
Oregon -0.224042  0.962558  1.018804
Texas  -0.068041  1.225634  2.073809
Utah   -1.355849  0.047368  1.691447

In [81]:
frame.sort_index(axis = 1, ascending = False)

               e         d         b
Utah    1.691447  0.047368 -1.355849
Ohio    0.823433  0.084762  0.943951
Texas   2.073809  1.225634 -0.068041
Oregon  1.018804  0.962558 -0.224042

In [82]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame.sort_values(by=['b','a'])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [83]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [84]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [85]:
obj[obj.rank()==1]

1   -5
dtype: int64

In [86]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [87]:
objs = pd.Series(np.arange(5), index = ['a','b','b','c','c'])
objs

a    0
b    1
b    2
c    3
c    4
dtype: int32

In [88]:
objs.index.is_unique

False

In [89]:
df = pd.DataFrame(np.arange(12).reshape(3,4), index= ['a','a','b'], columns = ['one','one','two','two'])

In [90]:
df

   one  one  two  two
a    0    1    2    3
a    4    5    6    7
b    8    9   10   11

In [91]:
df.loc['a','one']

   one  one
a    0    1
a    4    5

In [92]:
print(df.sum())
print(df.sum(axis = 'columns'))

one    12
one    15
two    18
two    21
dtype: int64
a     6
a    22
b    38
dtype: int64

In [93]:
obj = pd.Series(['a','a','b','c']*4)
print(obj)

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [94]:
print(obj.describe())
print(obj.min())

count     16
unique     3
top        a
freq       8
dtype: object
a

In [95]:
#conda install pandas-datareader #This installed the additional pandas-datareader package

In [96]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [97]:
print(all_data)

{'AAPL':                   High         Low        Open       Close       Volume  \
Date
2016-03-21   26.912500   26.285000   26.482500   26.477501  142010800.0
2016-03-22   26.822500   26.302500   26.312500   26.680000  129777600.0
2016-03-23   26.767500   26.475000   26.620001   26.532499  102814000.0
2016-03-24   26.562500   26.222500   26.367500   26.417500  104532000.0
2016-03-28   26.547501   26.264999   26.500000   26.297501   77645600.0
...                ...         ...         ...         ...          ...
2021-03-15  124.000000  120.419998  121.410004  123.989998   92403800.0
2021-03-16  127.220001  124.720001  125.699997  125.570000  114740000.0
2021-03-17  125.860001  122.339996  124.050003  124.760002  111437500.0
2021-03-18  123.180000  120.320000  122.879997  120.529999  121229700.0
2021-03-19  121.430000  119.680000  119.900002  119.989998  185023200.0

             Adj Close
Date
2016-03-21   24.626959
2016-03-22   24.815302
2016-03-23   24.678110
2016-03-24   24.571148
2016-03-28   24.459534
...                ...
2021-03-15  123.989998
2021-03-16  125.570000
2021-03-17  124.760002
2021-03-18  120.529999
2021-03-19  119.989998

[1259 rows x 6 columns], 'IBM':                   High         Low        Open       Close     Volume  \
Date
2016-03-21  148.710007  146.720001  147.300003  148.630005  3721600.0
2016-03-22  149.279999  147.839996  148.059998  148.100006  4081900.0
2016-03-23  148.029999  145.130005  148.000000  145.399994  4764200.0
2016-03-24  148.220001  144.490005  144.979996  147.949997  5044500.0
2016-03-28  148.649994  147.229996  147.750000  148.399994  3265100.0
...                ...         ...         ...         ...        ...
2021-03-15  128.750000  127.540001  127.769997  128.580002  3420600.0
2021-03-16  128.520004  127.339996  128.279999  128.240005  4630400.0
2021-03-17  129.490005  127.489998  128.460007  129.029999  4244800.0
2021-03-18  131.000000  127.790001  128.940002  130.059998  5834600.0
2021-03-19  130.440002  128.529999  130.020004  128.899994  9830600.0

             Adj Close
Date
2016-03-21  119.187241
2016-03-22  118.762215
2016-03-23  116.597069
2016-03-24  118.641922
2016-03-28  119.002792
...                ...
2021-03-15  128.580002
2021-03-16  128.240005
2021-03-17  129.029999
2021-03-18  130.059998
2021-03-19  128.899994

[1259 rows x 6 columns], 'MSFT':                   High         Low        Open       Close      Volume  \
Date
2016-03-21   53.930000   52.930000   53.250000   53.860001  23925700.0
2016-03-22   54.250000   53.459999   53.610001   54.070000  23124100.0
2016-03-23   54.240002   53.740002   54.110001   53.970001  20129000.0
2016-03-24   54.330002   53.730000   53.840000   54.209999  19950000.0
2016-03-28   54.290001   53.330002   54.209999   53.540001  17025100.0
...                ...         ...         ...         ...         ...
2021-03-15  235.190002  231.809998  234.960007  234.809998  26034900.0
2021-03-16  240.059998  235.940002  236.279999  237.710007  27717700.0
2021-03-17  238.550003  233.229996  236.149994  237.039993  29500700.0
2021-03-18  234.190002  230.330002  232.559998  230.720001  34833000.0
2021-03-19  232.470001  229.350006  231.020004  230.350006  46410700.0

             Adj Close
Date
2016-03-21   49.388100
2016-03-22   49.580658
2016-03-23   49.488972
2016-03-24   49.709045
2016-03-28   49.094669
...                ...
2021-03-15  234.809998
2021-03-16  237.710007
2021-03-17  237.039993
2021-03-18  230.720001
2021-03-19  230.350006

[1259 rows x 6 columns], 'GOOG':                    High          Low         Open        Close   Volume  \
Date
2016-03-21   742.500000   733.515991   736.500000   742.090027  1836500
2016-03-22   745.000000   737.460022   737.460022   740.750000  1269700
2016-03-23   745.719971   736.150024   742.359985   738.059998  1432100
2016-03-24   737.747009   731.000000   732.010010   735.299988  1594900
2016-03-28   738.989990   732.500000   736.789978   733.530029  1301300
...                 ...          ...          ...          ...      ...
2021-03-15  2067.060059  2043.510010  2062.300049  2066.489990  1298100
2021-03-16  2123.560059  2070.000000  2078.989990  2092.520020  1490600
2021-03-17  2109.780029  2054.000000  2076.030029  2091.080078  1297500
2021-03-18  2075.500000  2033.550049  2061.000000  2036.219971  1361400
2021-03-19  2053.100098  2017.680054  2042.050049  2043.199951  2314400

              Adj Close
Date
2016-03-21   742.090027
2016-03-22   740.750000
2016-03-23   738.059998
2016-03-24   735.299988
2016-03-28   733.530029
...                 ...
2021-03-15  2066.489990
2021-03-16  2092.520020
2021-03-17  2091.080078
2021-03-18  2036.219971
2021-03-19  2043.199951

[1259 rows x 6 columns]}

In [98]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2021-03-15  0.024457  0.007601 -0.003987  0.002216
2021-03-16  0.012743 -0.002644  0.012350  0.012596
2021-03-17 -0.006451  0.006160 -0.002819 -0.000688
2021-03-18 -0.033905  0.007983 -0.026662 -0.026235
2021-03-19 -0.004480 -0.008919 -0.001604  0.003428

In [99]:
print(returns['MSFT'].corr(returns['IBM']))
print(returns['IBM'].corr(returns['MSFT']))

0.5323770902587902
0.5323770902587901

In [100]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.446326  0.712554  0.652137
IBM   0.446326  1.000000  0.532377  0.499969
MSFT  0.712554  0.532377  1.000000  0.779324
GOOG  0.652137  0.499969  0.779324  1.000000

In [101]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000365  0.000140  0.000236  0.000209
IBM   0.000140  0.000268  0.000151  0.000137
MSFT  0.000236  0.000151  0.000301  0.000227
GOOG  0.000209  0.000137  0.000227  0.000281

In [102]:
returns.corrwith(returns.IBM)

AAPL    0.446326
IBM     1.000000
MSFT    0.532377
GOOG    0.499969
dtype: float64

In [103]:
returns.corrwith(volume)

AAPL   -0.073934
IBM    -0.114986
MSFT   -0.084474
GOOG   -0.133995
dtype: float64

In [104]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [105]:
uniques = obj.unique()
uniques.sort() #inplace
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [106]:
pd.value_counts(obj.values, sort=False)

a    3
d    1
b    2
c    3
dtype: int64

In [107]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [108]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [109]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])

In [110]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [111]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                    'Qu2': [2, 3, 1, 2, 3],
                    'Qu3': [1, 5, 2, 4, 4]})

In [112]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [113]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [114]:
admit = pd.read_csv('Admission_Predict.csv', index_col='Serial No.') #index_col = 0 is also feasible

In [115]:
admit.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [116]:
new_df = admit.rename(columns ={'SOP':'Statement of Purpose'})
new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [117]:
new_df = admit.rename(mapper = str.strip, axis = 'columns') #strip funciton is similar to ltrim rtrim in SQL 
#mapper argument will map the function

In [118]:
admit.columns = map(str.strip, admit.columns)
admit.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR', 'CGPA',
       'Research', 'Chance of Admit'],
      dtype='object')

In [119]:
admit.columns = map(str.lower,list(map(str.strip, admit.columns)))
admit.head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [120]:
admit.where(admit['chance of admit'] > 0.7) #Just makes the values as NaN where mask == False

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
396,324.0,110.0,3.0,3.5,3.5,9.04,1.0,0.82
397,325.0,107.0,3.0,3.0,3.5,9.11,1.0,0.84
398,330.0,116.0,4.0,5.0,4.5,9.45,1.0,0.91
399,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
400,333.0,117.0,4.0,5.0,4.0,9.66,1.0,0.95

In [121]:
admit.where(admit['chance of admit'] > 0.7).dropna() #this will drop the rows where mask == False

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
6,330.0,115.0,5.0,4.5,3.0,9.34,1.0,0.90
...,...,...,...,...,...,...,...,...
395,329.0,111.0,4.0,4.5,4.0,9.23,1.0,0.89
396,324.0,110.0,3.0,3.5,3.5,9.04,1.0,0.82
397,325.0,107.0,3.0,3.0,3.5,9.11,1.0,0.84
398,330.0,116.0,4.0,5.0,4.5,9.45,1.0,0.91
400,333.0,117.0,4.0,5.0,4.0,9.66,1.0,0.95

In [122]:
admit[admit['chance of admit'] > 0.7] #This returns same values as above cell

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
6,330,115,5,4.5,3.0,9.34,1,0.90
...,...,...,...,...,...,...,...,...
395,329,111,4,4.5,4.0,9.23,1,0.89
396,324,110,3,3.5,3.5,9.04,1,0.82
397,325,107,3,3.0,3.5,9.11,1,0.84
398,330,116,4,5.0,4.5,9.45,1,0.91
400,333,117,4,5.0,4.0,9.66,1,0.95

In [123]:
admit['chance of admit'] > 0.7

Serial No.
1       True
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398     True
399    False
400     True
Name: chance of admit, Length: 400, dtype: bool

In [124]:
(admit['chance of admit'] > 0.7) & (admit['chance of admit'] < 0.9)

Serial No.
1      False
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398    False
399    False
400    False
Name: chance of admit, Length: 400, dtype: bool

In [125]:
admit['chance of admit'].gt(0.7).lt(0.9) #gt and lt are greater than and less than respectively, can be chained
#returns same result as above cell

Serial No.
1      False
2      False
3      False
4      False
5       True
       ...
396    False
397    False
398    False
399     True
400    False
Name: chance of admit, Length: 400, dtype: bool

In [126]:
admit.head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [127]:
admit.reset_index()

,Serial No.,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...,...
395,396,324,110,3,3.5,3.5,9.04,1,0.82
396,397,325,107,3,3.0,3.5,9.11,1,0.84
397,398,330,116,4,5.0,4.5,9.45,1,0.91
398,399,312,103,3,3.5,4.0,8.78,0,0.67
399,400,333,117,4,5.0,4.0,9.66,1,0.95

In [128]:
admit = admit.set_index(['chance of admit'])
admit.head()

,gre score,toefl score,university rating,sop,lor,cgpa,research
chance of admit,,,,,,,
0.92,337,118,4,4.5,4.5,9.65,1
0.76,324,107,4,4.0,4.5,8.87,1
0.72,316,104,3,3.0,3.5,8.00,1
0.80,322,110,3,3.5,2.5,8.67,1
0.65,314,103,2,2.0,3.0,8.21,0

### Multi level index

In [129]:
census = pd.read_csv("census.csv")

In [130]:
columns_to_keep = ['STNAME', 'CTYNAME', 'BIRTHS2010','BIRTHS2011','BIRTHS2012','BIRTHS2013','BIRTHS2014','BIRTHS2015'
                  ,'POPESTIMATE2010','POPESTIMATE2011','POPESTIMATE2012','POPESTIMATE2013','POPESTIMATE2014'
                  ,'POPESTIMATE2015']
census = census[columns_to_keep]
census.head()

,STNAME,CTYNAME,BIRTHS2010,BIRTHS2011,BIRTHS2012,BIRTHS2013,BIRTHS2014,BIRTHS2015,POPESTIMATE2010,POPESTIMATE2011,POPESTIMATE2012,POPESTIMATE2013,POPESTIMATE2014,POPESTIMATE2015
0,Alabama,Alabama,14226,59689,59062,57938,58334,58305,4785161,4801108,4816089,4830533,4846411,4858979
1,Alabama,Autauga County,151,636,615,574,623,600,54660,55253,55175,55038,55290,55347
2,Alabama,Baldwin County,517,2187,2092,2160,2186,2240,183193,186659,190396,195126,199713,203709
3,Alabama,Barbour County,70,335,300,283,260,269,27341,27226,27159,26973,26815,26489
4,Alabama,Bibb County,44,266,245,259,247,253,22861,22733,22642,22512,22549,22583

In [131]:
census = census.set_index(['STNAME', 'CTYNAME'])
census.head()

                        BIRTHS2010  BIRTHS2011  BIRTHS2012  BIRTHS2013  \
STNAME  CTYNAME
Alabama Alabama              14226       59689       59062       57938
        Autauga County         151         636         615         574
        Baldwin County         517        2187        2092        2160
        Barbour County          70         335         300         283
        Bibb County             44         266         245         259

                        BIRTHS2014  BIRTHS2015  POPESTIMATE2010  \
STNAME  CTYNAME
Alabama Alabama              58334       58305          4785161
        Autauga County         623         600            54660
        Baldwin County        2186        2240           183193
        Barbour County         260         269            27341
        Bibb County            247         253            22861

                        POPESTIMATE2011  POPESTIMATE2012  POPESTIMATE2013  \
STNAME  CTYNAME
Alabama Alabama                 4801108          4816089          4830533
        Autauga County            55253            55175            55038
        Baldwin County           186659           190396           195126
        Barbour County            27226            27159            26973
        Bibb County               22733            22642            22512

                        POPESTIMATE2014  POPESTIMATE2015
STNAME  CTYNAME
Alabama Alabama                 4846411          4858979
        Autauga County            55290            55347
        Baldwin County           199713           203709
        Barbour County            26815            26489
        Bibb County               22549            22583

In [132]:
census.loc['Michigan','Washtenaw County']

C:\Users\Vaibhav\anaconda3\lib\site-packages\ipykernel_launcher.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  """Entry point for launching an IPython kernel.

,,BIRTHS2010,BIRTHS2011,BIRTHS2012,BIRTHS2013,BIRTHS2014,BIRTHS2015,POPESTIMATE2010,POPESTIMATE2011,POPESTIMATE2012,POPESTIMATE2013,POPESTIMATE2014,POPESTIMATE2015
STNAME,CTYNAME,,,,,,,,,,,,
Michigan,Washtenaw County,977,3826,3780,3662,3683,3709,345563,349048,351213,354289,357029,358880

In [133]:
census.loc[ [('Michigan','Washtenaw County'),
           ('Michigan','Wayne County')] ] #Pass a list of tuples

                           BIRTHS2010  BIRTHS2011  BIRTHS2012  BIRTHS2013  \
STNAME   CTYNAME
Michigan Washtenaw County         977        3826        3780        3662
         Wayne County            5918       23819       23270       23377

                           BIRTHS2014  BIRTHS2015  POPESTIMATE2010  \
STNAME   CTYNAME
Michigan Washtenaw County        3683        3709           345563
         Wayne County           23607       23586          1815199

                           POPESTIMATE2011  POPESTIMATE2012  POPESTIMATE2013  \
STNAME   CTYNAME
Michigan Washtenaw County           349048           351213           354289
         Wayne County              1801273          1792514          1775713

                           POPESTIMATE2014  POPESTIMATE2015
STNAME   CTYNAME
Michigan Washtenaw County           357029           358880
         Wayne County              1766008          1759335

In [134]:
df = pd.read_csv("class_grades.csv")

In [137]:
mask = df.isnull()

In [138]:
mask.head(10)

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0   False       False     False    False     False  False
1   False       False     False    False     False  False
2   False       False     False     True     False  False
3   False        True      True    False     False  False
4   False       False     False    False     False  False
5   False       False     False    False     False  False
6   False       False     False    False     False  False
7   False       False     False    False      True  False
8   False       False     False    False     False  False
9   False       False     False    False     False  False

In [140]:
df.fillna(0, inplace=True)

In [142]:
df = pd.DataFrame({'A' : [1,3,5,2,1],
                   'B' : [3,3,1,6,8],
                   'C' : ['a','b','c','d','e']})
df

   A  B  C
0  1  3  a
1  3  3  b
2  5  1  c
3  2  6  d
4  1  8  e

In [143]:
df.replace(1,100)

     A    B  C
0  100    3  a
1    3    3  b
2    5  100  c
3    2    6  d
4  100    8  e

In [144]:
df.replace([1,3], [100,300])

     A    B  C
0  100  300  a
1  300  300  b
2    5  100  c
3    2    6  d
4  100    8  e

In [146]:
log = pd.read_csv("log.csv")
log.head()

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6    NaN     NaN
2  1469974544  cheryl  intro.html                  9    NaN     NaN
3  1469974574  cheryl  intro.html                 10    NaN     NaN
4  1469977514     bob  intro.html                  1    NaN     NaN

In [154]:
log.replace(to_replace='.*.html$',value ='webpage', regex = True)

          time    user    video  playback position paused  volume
0   1469974424  cheryl  webpage                  5  False    10.0
1   1469974454  cheryl  webpage                  6    NaN     NaN
2   1469974544  cheryl  webpage                  9    NaN     NaN
3   1469974574  cheryl  webpage                 10    NaN     NaN
4   1469977514     bob  webpage                  1    NaN     NaN
5   1469977544     bob  webpage                  1    NaN     NaN
6   1469977574     bob  webpage                  1    NaN     NaN
7   1469977604     bob  webpage                  1    NaN     NaN
8   1469974604  cheryl  webpage                 11    NaN     NaN
9   1469974694  cheryl  webpage                 14    NaN     NaN
10  1469974724  cheryl  webpage                 15    NaN     NaN
11  1469974454     sue  webpage                 24    NaN     NaN
12  1469974524     sue  webpage                 25    NaN     NaN
13  1469974424     sue  webpage                 23  False    10.0
14  1469974554     sue  webpage                 26    NaN     NaN
15  1469974624     sue  webpage                 27    NaN     NaN
16  1469974654     sue  webpage                 28    NaN     5.0
17  1469974724     sue  webpage                 29    NaN     NaN
18  1469974484  cheryl  webpage                  7    NaN     NaN
19  1469974514  cheryl  webpage                  8    NaN     NaN
20  1469974754     sue  webpage                 30    NaN     NaN
21  1469974824     sue  webpage                 31    NaN     NaN
22  1469974854     sue  webpage                 32    NaN     NaN
23  1469974924     sue  webpage                 33    NaN     NaN
24  1469977424     bob  webpage                  1   True    10.0
25  1469977454     bob  webpage                  1    NaN     NaN
26  1469977484     bob  webpage                  1    NaN     NaN
27  1469977634     bob  webpage                  1    NaN     NaN
28  1469977664     bob  webpage                  1    NaN     NaN
29  1469974634  cheryl  webpage                 12    NaN     NaN
30  1469974664  cheryl  webpage                 13    NaN     NaN
31  1469977694     bob  webpage                  1    NaN     NaN
32  1469977724     bob  webpage                  1    NaN     NaN

In [155]:
df = pd.read_csv("presidents.csv")

In [156]:
df.head(10)

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days"
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days"
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days"
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days"
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days"
5,6,John Quincy Adams,"Jul 11, 1767","57 years, 236 daysMar 4, 1825","61 years, 236 daysMar 4, 1829","18 years, 356 days","Feb 23, 1848","80 years, 227 days"
6,7,Andrew Jackson,"Mar 15, 1767","61 years, 354 daysMar 4, 1829","69 years, 354 daysMar 4, 1837","8 years, 96 days","Jun 8, 1845","78 years, 85 days"
7,8,Martin Van Buren,"Dec 5, 1782","54 years, 89 daysMar 4, 1837","58 years, 89 daysMar 4, 1841","21 years, 142 days","Jul 24, 1862","79 years, 231 days"
8,9,William H. Harrison,"Feb 9, 1773","68 years, 23 daysMar 4, 1841","68 years, 54 days Apr 4, 1841[b]",NaN,"Apr 4, 1841","68 years, 54 days"
9,10,John Tyler,"Mar 29, 1790","51 years, 6 daysApr 4, 1841","54 years, 340 daysMar 4, 1845","16 years, 320 days","Jan 18, 1862","71 years, 295 days"

In [157]:
def splitname(row):
    row['First'] = row['President'].split(" ")[0]
    row['Last'] = row['President'].split(" ")[-1]
    return row

df = df.apply(splitname, axis = "columns")

In [159]:
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First,Last
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days",George,Washington
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days",John,Adams
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days",Thomas,Jefferson
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days",James,Madison
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days",James,Monroe

In [160]:
del(df['First'])
del(df['Last'])

In [161]:
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days"
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days"
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days"
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days"
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days"

In [167]:
pattern = "(?P<First>[\w]*)(?:.* )(?P<Last>[\w]*$)"

In [169]:
df['President'].str.extract(pattern).head()

    First        Last
0  George  Washington
1    John       Adams
2  Thomas   Jefferson
3   James     Madison
4   James      Monroe

In [170]:
df['First'] = df['President'].str.extract(pattern)["First"]
df['Last'] = df['President'].str.extract(pattern)["Last"]

In [172]:
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First,Last
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days",George,Washington
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days",John,Adams
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days",Thomas,Jefferson
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days",James,Madison
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days",James,Monroe

In [176]:
df['Born'] = df['Born'].str.extract("([\w]{3} [0-9]{1,2}, [0-9]{4})")

In [178]:
df["Born"] = pd.to_datetime(df['Born'])

In [179]:
df['Born'].head()

0   1732-02-22
1   1735-10-30
2   1743-04-13
3   1751-03-16
4   1758-04-28
Name: Born, dtype: datetime64[ns]